<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas II

## 1.0 Importing our Libraries

In [ ]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file

This dataset contains trips taken by thousands of kenyans to and from Nairobi during the year 2018.

*   Dataset link for download or access: [Link](https://drive.google.com/a/moringaschool.com/file/d/1xe2sHapdeGo7bIaiG7UV0rjgQZ5U6OXv/view?usp=sharing)

In [ ]:
# Let's read the data from the CSV file and create the dataframe to be used
# 

df = pd.read_csv('bus_travels.csv') 
df

      ride_id travel_date travel_time  ... travel_to car_type max_capacity
0         247  2018-05-07       07:06  ...   Nairobi      Bus           49
1         256  2018-05-06       11:08  ...   Nairobi  shuttle           11
2         275  2018-05-04       05:00  ...   Nairobi  shuttle           11
3         285  2018-05-04       09:10  ...   Nairobi  shuttle           11
4         286  2018-05-04       09:20  ...   Nairobi  shuttle           11
...       ...         ...         ...  ...       ...      ...          ...
1106    15336  2018-05-07       07:01  ...   Nairobi      Bus           49
1107    15337  2018-05-07       07:08  ...   Nairobi      Bus           49
1108    15338  2018-05-07       07:04  ...   Nairobi      Bus           49
1109    15339  2018-05-07       07:05  ...   Nairobi      Bus           49
1110    15344  2018-05-09       08:00  ...   Nairobi      Bus           49

[1111 rows x 7 columns]

## 1.2 Previewing our Dataset

In [ ]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

   ride_id travel_date travel_time travel_from travel_to car_type  max_capacity
0      247  2018-05-07       07:06       Kisii   Nairobi      Bus            49
1      256  2018-05-06       11:08       Kisii   Nairobi  shuttle            11
2      275  2018-05-04       05:00       Kisii   Nairobi  shuttle            11
3      285  2018-05-04       09:10       Kisii   Nairobi  shuttle            11
4      286  2018-05-04       09:20       Kisii   Nairobi  shuttle            11
5      287  2018-05-04       07:02       Kisii   Nairobi      Bus            49
6      288  2018-05-04       09:30       Kisii   Nairobi  shuttle            11
7      292  2018-05-04       19:03       Kisii   Nairobi      Bus            49
8      298  2018-05-04       09:00       Kisii   Nairobi  shuttle            11
9      302  2018-05-04       08:40       Kisii   Nairobi  shuttle            11

## 1.3 Accessing Information about our Dataset

In [ ]:
# Getting to know more about the dataset by accessing its information
#
#general stats on the data
df.describe()

#checking unique items
df.car_type.unique()

#max capacity
df.max_capacity.max()

#min capacity
df.max_capacity.min()

#earliest time of travel
df.travel_time.min()

#latest time of travel
df.travel_time.max()

#check data type
df.dtypes

ride_id          int64
travel_date     object
travel_time     object
travel_from     object
travel_to       object
car_type        object
max_capacity     int64
dtype: object

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [ ]:
# Challenge 1
# How many trips were taken on the 22/04/18?
# 

#df.loc[df.travel_date == '22/04/18'].groupby(df['ride_id']).count()
df_t = df[(df['travel_date'] == '2018-04-22')]
df_t
df_t.value_counts()
len(df_t)

66

In [ ]:
# Challenge 2
# Which type of vehicle travelled on 23/04/18 from Kisii to Nairobi at 7.15am?
#

x = df[df['travel_date']  == '2018-04-23'] 
x

y = x[x['travel_from'] == 'Kisii']
y

z = y[y['travel_to'] == 'Nairobi']
z

t = z[z['travel_time'] == '07:15']
t
t['car_type']
#df.dtypes

497    shuttle
Name: car_type, dtype: object

In [ ]:
# Challenge 3
# How many trips were made from Kisii to Nairobi?
# 

#df[(df['travel_from'] == 'Kisii') & (df['travel_to'] == 'Nairobi')].count()
k = df[df['travel_from'] == 'Kisii']
k

n = k[k['travel_to'] == 'Nairobi']
n.value_counts()
len(n)

545

In [ ]:
# Challenge 4
# How many trips were made by shuttle from Nairobi?
# 

#df[(df['travel_from'] == 'Nairobi') & (df['car_type'] == 'shuttle')].count()

s = df[df['car_type'] == 'shuttle']
s
on = s[s['travel_from'] == 'Nairobi']
on
len(on)

0

In [ ]:
# Challenge 5
# How many trips were made by bus from Nairobi to Awendo?
# 

b = df[df['car_type'] == 'Bus']
b
on = b[b['travel_from'] == 'Nairobi']
on
to = on[on['travel_to'] == 'Awendo']
to
len(to)

0

In [ ]:
df['travel_to'].unique()

array(['Nairobi'], dtype=object)

In [ ]:
# Challenge 6
# Which was the most travelled from destination by bus?
# 
x1 = df[df['car_type'] == 'Bus']
x1
q = x1['travel_from'].value_counts()
q.sort_values(ascending=False).head(1)

Rongo    115
Name: travel_from, dtype: int64

In [ ]:
# Challenge 7
# Which was the most travelled to destination?
# 
df['travel_to'].value_counts()

Nairobi    1111
Name: travel_to, dtype: int64

In [ ]:
# Challenge 8
# Which was the most travelled destination by bus?
# 

x2 = df[df['car_type'] == 'Bus']
x2
q1 = x1['travel_to'].value_counts()
q1.sort_values(ascending=False).head(1)

Nairobi    599
Name: travel_to, dtype: int64

In [ ]:
# Challenge 9
# Which town did not have a departure by shuttle?
# 

#df['travel_from']
#df[(~df['car_type'] == 'shuttle')].travel_to.unique()
#df['car_type'] == 'shuttle' not in df.travel_from
#sh = df[df['car_type'] != 'shuttle']
#sh
#df['travel_from']
#df[(df.car_type != 'shuttle') & (df.car_type == 'Bus')]

dep1 = df[df['car_type'] == 'shuttle']
dep1 = dep1['travel_from'].value_counts()
dep2 = df[df['car_type'] != 'shuttle']
dep2 = dep2['travel_from'].value_counts()
#w = dep['travel_from'].value_counts()
#print(dep1.sort_values(ascending=True))
#print(dep2.sort_values(ascending=True))

l = list(dep1)
#dep2[dep2 not in l]
dep2.loc[~(dep2[:].isin (dep1))]

Rongo        115
Kisii        110
Homa Bay      53
Awendo        44
Rodi          43
Migori        41
Nyachenge     34
Kehancha      32
Ndhiwa        29
Sirare        28
Mbita         25
Kijauri       17
Oyugis        12
Sori          10
Keroka         6
Name: travel_from, dtype: int64

In [ ]:
# Challenge 10
# Which were the most 5 travelled from destinations?
# 

 #df.groupby("group_ID")["value"].rank("dense", ascending=False)
#m = df.groupby("travel_from")['max_capacity']
#m1 = m.sum()
#m1.sort_values(ascending=False).head(5)

m = df['travel_from'].value_counts()
m.sort_values(ascending=False).head(5)

Kisii       545
Rongo       115
Kijauri      79
Homa Bay     53
Awendo       44
Name: travel_from, dtype: int64

In [ ]:
# Challenge 11
# Which were the least 5 travelled to destinations?
#
n = df['travel_to'].value_counts()
n.sort_values(ascending=False).head(5)

Nairobi    1111
Name: travel_to, dtype: int64

In [ ]:
# Challenge 12
# If all shuttles travelled with full capacity, how many people travelled in shuttles from Kisii to Nairobi 
#in the month of May?
#

kd = df[df['travel_from'] == 'Kisii']
kd

mt = kd[kd['travel_date'] >= '2018-05-01'] 
mt
mt1 = mt[mt['travel_date'] <= '2018-05-31']
mt1

mt1['max_capacity'].sum()

3630

In [ ]:
df.head()

   ride_id travel_date travel_time travel_from travel_to car_type  max_capacity
0      247  2018-05-07       07:06       Kisii   Nairobi      Bus            49
1      256  2018-05-06       11:08       Kisii   Nairobi  shuttle            11
2      275  2018-05-04       05:00       Kisii   Nairobi  shuttle            11
3      285  2018-05-04       09:10       Kisii   Nairobi  shuttle            11
4      286  2018-05-04       09:20       Kisii   Nairobi  shuttle            11

In [ ]:
# Challenge 13
# Which date had the highest no. of trips in June?
#
tt = df[(df['travel_date'] > '2018-06-01') & (df['travel_date'] <= '2018-06-23')]
len(tt)

0

In [ ]:
# Challenge 14
# On average, how many trips were made by all vehicles in a day?
#

tr = df['travel_date'].value_counts()
tr
avgtr = tr.sum()/tr.count()
avgtr

61.72222222222222

In [ ]:
# Challenge 15 
# On average, how many buses and shuttles travelled in a day?
# 
b = df[df['car_type'] == 'Bus']
b

btr = b['travel_date'].value_counts()
btr
btavg = btr.sum()/btr.count()
print(btavg)

s = df[df['car_type'] == 'shuttle']
s
sr = s['travel_date'].value_counts()
sr
sravg = sr.sum()/sr.count()
print(sravg)

33.27777777777778
34.13333333333333